#include "sys.h"   
#include "motor.h"
#include "timer.h"
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//ALIENTEK Mini STM32开发板
//LED驱动代码	   
//Jiapengfeng
//技术论坛:www.openedv.com
//修改日期:2015/3/12
//版本：V1.0
//版权所有，盗版必究。
//All rights reserved									  
////////////////////////////////////////////////////////////////////////////////// 	   

//初始化PA8和PA9为输出口.并使能这两个口的时钟		    
//电机与舵机的初始化
void MOTOR_Init(void)
{
	PWM_Init_Tim3(19999,71);   //PWM频率=72000000/(19999+1)/(71+1)=50hz	
}
